'''Sequence VIII'''
def main(num):
    '''Sequence VIII'''
    for i in range(num):
        for j in range(num):
            if i+j >= num-1:
                print("%02d" %((i+j)-(num-2)), end=" ")
            else:
                print("  ", end=" ")
        print()
main(int(input()))

#แถวที่ i หลักที่ j
#    00 01 02 03 04 05 06 07 08 09 10
# 00                               01 (0, 10)
# 01                            01 02
# 02                         01 02 03
# 03                      01 02 03 04
# 04                   01 02 03 04 05
# 05                01 02 03 04 05 06
# 06             01 02 03 04 05 06 07
# 07          01 02 03 04 05 06 07 08
# 08       01 02 03 04 05 06 07 08 09
# 09    01 02 03 04 05 06 07 08 09 10
# 10 01 02 03 04 05 06 07 08 09 10 11
